app/Controllers/ApiController.php

    public function monthly()
    {
        $data = [
            'query' => [],
            'results' => [],
            'status' => ["code" => 401, "description" => "Unauthorized"]
        ];

        $headers = $this->request->headers();
        $postData = $this->request->getPost();

        $data['query'] = $postData;

        array_walk($headers, function (&$value, $key) {
            $value = $value->getValue();
        });

        if ($headers["Key"] == $this->apikey) {
            if ($postData['type'] == 'transaction') {
                $result = $this->transaction->select('COUNT(*) as jml')->like('created_at', '' . $postData['tahun'] . '-' . $postData['bulan'] . '', 'after')->first();
                $data['results'] = $result;
                $data['status'] = ["code" => 200, "description" => "OK"];
            } elseif ($postData['type'] == 'earning') {
                $result = $this->transaction->select('sum(total_harga) as jml')->like('created_at', '' . $postData['tahun'] . '-' . $postData['bulan'] . '', 'after')->first();
                $data['results'] = $result;
                $data['status'] = ["code" => 200, "description" => "OK"];
            } elseif ($postData['type'] == 'user') {
                $result = $this->user->select('COUNT(*) as jml')->like('created_at', '' . $postData['tahun'] . '-' . $postData['bulan'] . '', 'after')->first();
---
SELECT COUNT(*) as jml
FROM `transaction`
WHERE `created_at` LIKE '2024-07%' ESCAPE '!'
 LIMIT 1
SELECT sum(total_harga) as jml
FROM `transaction`
WHERE `created_at` LIKE '2024-07%' ESCAPE '!'
 LIMIT 1
SELECT COUNT(*) as jml
FROM `user`
WHERE `created_at` LIKE '2024-07%' ESCAPE '!'
 LIMIT 1

    public function yearly()
    {
        $data = [
            'query' => [],
            'results' => [],
            'status' => ["code" => 401, "description" => "Unauthorized"]
        ];

        $headers = $this->request->headers();
        $postData = $this->request->getPost();

        $data['query'] = $postData;

        array_walk($headers, function (&$value, $key) {
            $value = $value->getValue();
        });


        if ($headers["Key"] == $this->apikey) {
            if ($postData['type'] == 'transaction') {
                $result = $this->transaction->select('COUNT(*) as jml')->like('created_at', '' . $postData['tahun'] . '', 'after')->first();
                $data['results'] = $result;
                $data['status'] = ["code" => 200, "description" => "OK"];
            } elseif ($postData['type'] == 'earning') {
                $result = $this->transaction->select('sum(total_harga) as jml')->like('created_at', '' . $postData['tahun'] . '', 'after')->first();
                $data['results'] = $result;
                $data['status'] = ["code" => 200, "description" => "OK"];
            } elseif ($postData['type'] == 'user') {
                $result = $this->user->select('COUNT(*) as jml')->like('created_at', '' . $postData['tahun'] . '', 'after')->first();
---
SELECT COUNT(*) as jml
FROM `transaction`
WHERE `created_at` LIKE '2024%' ESCAPE '!'
 LIMIT 1
SELECT sum(total_harga) as jml
FROM `transaction`
WHERE `created_at` LIKE '2024%' ESCAPE '!'
 LIMIT 1
SELECT COUNT(*) as jml
FROM `user`
WHERE `created_at` LIKE '2024%' ESCAPE '!'
 LIMIT 1